In [6]:
from sklearn.preprocessing import OneHotEncoder
import pandas as pd
import numpy as np

In [32]:
data = pd.DataFrame({'a':[1.232,2.2323,3.4342],
                     'b':['apple','banana','banana'],
                     'c':['bob','rob','sally'],
                     'd':[232,656,343],
                     'e':[1,0,0]})
categ = ['b','c']
data

        a       b      c    d  e
0  1.2320   apple    bob  232  1
1  2.2323  banana    rob  656  0
2  3.4342  banana  sally  343  0

In [33]:
enc = OneHotEncoder().fit(data[categ])  # fit to categorical vars
dummy_categ = enc.transform(data[categ])

# concatenate categorical features and year of birth feature
dummy_categ = pd.DataFrame(dummy_categ.toarray())
features = pd.concat([dummy_categ, data.drop(categ+['e'], axis=1)], axis=1)
features

     0    1    2    3    4       a    d
0  1.0  0.0  1.0  0.0  0.0  1.2320  232
1  0.0  1.0  0.0  1.0  0.0  2.2323  656
2  0.0  1.0  0.0  0.0  1.0  3.4342  343

In [37]:
features.columns = [str(i) for i in features.columns]
features.columns

Index(['0', '1', '2', '3', '4', 'a', 'd'], dtype='object')